IDEA StatiCa Open Model
IdeaConImportSettings Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The IdeaConImportSettings type exposes the following members.
Properties
Name | Description
CanChangeDesignCodeInWizard
 Can change design code in Wizard
ConnectionFileName
 Gets or sets the name of the Connection project
DefaultBoltAssembly
 Gets or sets the name of the default bolt assembly
DefaultSteelMaterial
 Gets or sets the name of the default material of plates which are added from the template
DefaultWeldMaterial
 Gets or sets the name of the default weld material
DesignCode
 Gets or sets the Design Code There can be : ECEN AISC CISC RUS
ExportAllLinearCombination
 All linear combination will be exported to IDEA connection
OnePageWizard
 One page wizard
OrderMembersById
 If true, connected members in connection are ordered acoording to topological rules othewise by their IDs.
ProjectDescription
 Description
ProjectName
 Name
RunningApplication
 Running application
StartIdeaStaticaApp
 StartIdeaStaticaApp
UserWizardBrand
 Set user Wizard Brand
UseWizard
 Open import wizard window
WaitForExit
 WaitForExit
Top
See Also
Reference
IdeaConImportSettings Class
IdeaRS.OpenModel.Connection Namespace